/* Search criteria for other date properties of a file, such as when a photograph was taken, within a specific period before today */
"%@ %[Any Date]@" = "%1$@が%2$[任意の日付]@";
"%@ %[Today]@" = "%1$@が%2$[今日]@";
"%@ %[Since Yesterday]@" = "%1$@が%2$[昨日以降]@";
"%@ %[This week]@" = "%1$@が%2$[今週]@";
"%@ %[Within Last 2 weeks]@" = "%1$@が%2$[2 週間以内]@";
"%@ %[This month]@" = "%1$@が%2$[今月]@";
"%@ %[Within Last 2 months]@" = "%1$@が%2$[2 カ月以内]@";

/* Search criteria for other boolean properties of a file, such as whether red-eye correction was on */
"%@ %[Any]@" = "%1$@が%2$[いずれか]@";
"%@ %[Yes]@" = "%1$@が%2$[はい]@";
"%@ %[No]@" = "%1$@が%2$[いいえ]@";

/* Search criteria for other string properties of a file, such as the name of the author */
"%@ %[Contains]@ %@" = "%1$@が%3$@%2$[を含む]@";
"%@ %[Begins With]@ %@" = "%1$@が%3$@%2$[で始まる]@";
"%@ %[Ends With]@ %@" = "%1$@が%3$@%2$[で終わる]@";
"%@ %[Is]@ %@" = "%1$@が%3$@%2$[である]@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, on a specific date */
"%@ %[Exactly]@ %@" = "%1$@が%3$@%2$[と同じ]@";
"%@ %[Before]@ %@" = "%1$@が%3$@%2$[以前]@";
"%@ %[After]@ %@" = "%1$@が%3$@%2$[以後]@";

/* Search criteria for other numerical properties of a file, such as the pixel height of an image */
"%@ %[Greater than]@ %@" = "%1$@が%3$@%2$[より大きい]@";
"%@ %[Less than]@ %@" = "%1$@が%3$@%2$[より小さい]@";

/* Search criteria for other date properties of a file, such as when a photograph was taken, within a user-specified period of time before today */
"%@ %[Within Last]@ %@ %[Days]@" = "%1$@が%3$@%4$[日]@%2$[以内]@";
"%@ %[Within Last]@ %@ %[Weeks]@" = "%1$@が%3$@%4$[週間]@%2$[以内]@";
"%@ %[Within Last]@ %@ %[Months]@" = "%1$@が%3$@%4$[カ月]@%2$[以内]@";
"%@ %[Within Last]@ %@ %[Years]@" = "%1$@が%3$@%4$[年]@%2$[以内]@";

/* Search criteria for other color space properties of a file */
"%[Color Space]@ %[Any Color Space]@" = "%1$[色空間]@が%2$[いずれかの色空間]@";
"%[Color Space]@ %[RGB]@" = "%1$[色空間]@が%2$[RGB]@";
"%[Color Space]@ %[CMYK]@" = "%1$[色空間]@が%2$[CMYK]@";
"%[Color Space]@ %[Grayscale]@" = "%1$[色空間]@が%2$[グレイスケール]@";

/* Search criteria for files by contents */
"%[Contents]@ contain %@" = "%1$[内容]@が%2$@を含む";

/* Search criteria for time duration - minutes and seconds */
"%[Duration]@ %[Greater than]@ %@ %[min]@ %@ %[sec]@" = "%1$[再生時間]@が%3$@%4$[分]@%5$@%6$[秒]@%2$[より大きい]@";
"%[Duration]@ %[Less than]@ %@ %[min]@ %@ %[sec]@" = "%1$[再生時間]@が%3$@%4$[分]@%5$@%6$[秒]@%2$[より小さい]@";

/* Search criteria for files by keyword */
"%[Keywords]@ %@" = "%1$[キーワード]@が%2$@";

/* Search criteria for files by keyword containing */
"%[Keywords]@ contain %@" = "%1$[キーワード]@が%2$@を含む";

/* Search criteria for specific kinds of files */
"%[Kind]@ is %[Any]@" = "%1$[種類]@が%2$[任意]@";
"%[Kind]@ is %[Images]@" = "%1$[種類]@が%2$[イメージ]@";
"%[Kind]@ is %[Text]@" = "%1$[種類]@が%2$[テキスト]@";
"%[Kind]@ is %[PDF]@" = "%1$[種類]@が%2$[PDF]@";
"%[Kind]@ is %[Movies]@" = "%1$[種類]@が%2$[ムービー]@";
"%[Kind]@ is %[Music]@" = "%1$[種類]@が%2$[ミュージック]@";
"%[Kind]@ is %[Documents]@" = "%1$[種類]@が%2$[書類]@";
"%[Kind]@ is %[Presentations]@" = "%1$[種類]@が%2$[プレゼンテーション]@";
"%[Kind]@ is %[Folders]@" = "%1$[種類]@が%2$[フォルダ]@";
"%[Kind]@ is %[Applications]@" = "%1$[種類]@が%2$[アプリケーション]@";

/* Search criteria for other kinds of files */
"%[Kind]@ is %[Others...]@ %@" = "%1$[種類]@が%2$[その他...]@%3$@";

/* Search criteria for files by a particular label (color) */
"%[Label]@ is %@" = "%1$[ラベル]@が%2$@";

/* Search criteria for dates a fixed amount relative to today */
"%[Last Opened]@ %[Any Date]@" = "%1$[最後に開いた日]@が%2$[任意の日付]@";
"%[Last Modified]@ %[Any Date]@" = "%1$[最後に変更した日]@が%2$[任意の日付]@";
"%[Created]@ %[Any Date]@" = "%1$[作成日]@が%2$[任意の日付]@";
"%[Last Opened]@ %[Today]@" = "%1$[最後に開いた日]@が%2$[今日]@";
"%[Last Modified]@ %[Today]@" = "%1$[最後に変更した日]@が%2$[今日]@";
"%[Created]@ %[Today]@" = "%1$[作成日]@が%2$[今日]@";
"%[Last Opened]@ %[Since Yesterday]@" = "%1$[最後に開いた日]@が%2$[昨日以降]@";
"%[Last Modified]@ %[Since Yesterday]@" = "%1$[最後に変更した日]@が%2$[昨日以降]@";
"%[Created]@ %[Since Yesterday]@" = "%1$[作成日]@が%2$[昨日以降]@";
"%[Last Opened]@ %[This week]@" = "%1$[最後に開いた日]@が%2$[今週]@";
"%[Last Modified]@ %[This week]@" = "%1$[最後に変更した日]@が%2$[今週]@";
"%[Created]@ %[This week]@" = "%1$[作成日]@が%2$[今週]@";
"%[Last Opened]@ %[Within Last 2 weeks]@" = "%1$[最後に開いた日]@が%2$[2 週間以内]@";
"%[Last Modified]@ %[Within Last 2 weeks]@" = "%1$[最後に変更した日]@が%2$[2 週間以内]@";
"%[Created]@ %[Within Last 2 weeks]@" = "%1$[作成日]@が%2$[2 週間以内]@";
"%[Last Opened]@ %[This month]@" = "%1$[最後に開いた日]@が%2$[今月]@";
"%[Last Modified]@ %[This month]@" = "%1$[最後に変更した日]@が%2$[今月]@";
"%[Created]@ %[This month]@" = "%1$[作成日]@が%2$[今月]@";
"%[Last Opened]@ %[Within Last 2 months]@" = "%1$[最後に開いた日]@が%2$[2 カ月以内]@";
"%[Last Modified]@ %[Within Last 2 months]@" = "%1$[最後に変更した日]@が%2$[2 カ月以内]@";
"%[Created]@ %[Within Last 2 months]@" = "%1$[作成日]@が%2$[2 カ月以内]@";

/* Search criteria for specific dates */
"%[Last Opened]@ %[Exactly]@ %@" = "%1$[最後に開いた日]@が%3$@%2$[と同じ]@";
"%[Last Modified]@ %[Exactly]@ %@" = "%1$[最後に変更した日]@が%3$@%2$[と同じ]@";
"%[Created]@ %[Exactly]@ %@" = "%1$[作成日]@が%3$@%2$[と同じ]@";
"%[Last Opened]@ %[Before]@ %@" = "%1$[最後に開いた日]@が%3$@%2$[以前]@";
"%[Last Modified]@ %[Before]@ %@" = "%1$[最後に変更した日]@が%3$@%2$[以前]@";
"%[Created]@ %[Before]@ %@" = "%1$[作成日]@が%3$@%2$[以前]@";
"%[Last Opened]@ %[After]@ %@" = "%1$[最後に開いた日]@が%3$@%2$[以後]@";
"%[Last Modified]@ %[After]@ %@" = "%1$[最後に変更した日]@が%3$@%2$[以後]@";
"%[Created]@ %[After]@ %@" = "%1$[作成日]@が%3$@%2$[以後]@";

/* Search criteria for dates a variable amount relative to today */
"%[Last Opened]@ %[Within Last]@ %@ %[Days]@" = "%1$[最後に開いた日]@が%3$@%4$[日]@%2$[以内]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Days]@" = "%1$[最後に変更した日]@が%3$@%4$[日]@%2$[以内]@";
"%[Created]@ %[Within Last]@ %@ %[Days]@" = "%1$[作成日]@が%3$@%4$[日]@%2$[以内]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[最後に開いた日]@が%3$@%4$[週間]@%2$[以内]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[最後に変更した日]@が%3$@%4$[週間]@%2$[以内]@";
"%[Created]@ %[Within Last]@ %@ %[Weeks]@" = "%1$[作成日]@が%3$@%4$[週間]@%2$[以内]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Months]@" = "%1$[最後に開いた日]@が%3$@%4$[カ月]@%2$[以内]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Months]@" = "%1$[最後に変更した日]@が%3$@%4$[カ月]@%2$[以内]@";
"%[Created]@ %[Within Last]@ %@ %[Months]@" = "%1$[作成日]@が%3$@%4$[カ月]@%2$[以内]@";
"%[Last Opened]@ %[Within Last]@ %@ %[Years]@" = "%1$[最後に開いた日]@が%3$@%4$[年]@%2$[以内]@";
"%[Last Modified]@ %[Within Last]@ %@ %[Years]@" = "%1$[最後に変更した日]@が%3$@%4$[年]@%2$[以内]@";
"%[Created]@ %[Within Last]@ %@ %[Years]@" = "%1$[作成日]@が%3$@%4$[年]@%2$[以内]@";

/* Search criteria for musical genre type */
"%[Musical genre]@ %@" = "%1$[ミュージックのジャンル]@が%2$@";

/* Search criteria for name extension type */
"%[Name Extension]@ %@" = "%1$[ファイル拡張子]@が%2$@";

/* Search criteria for files by name */
"%[Name]@ %[Contains]@ %@" = "%1$[名前]@が%3$@%2$[を含む]@";
"%[Name]@ %[Begins With]@ %@" = "%1$[名前]@が%3$@%2$[で始まる]@";
"%[Name]@ %[Ends With]@ %@" = "%1$[名前]@が%3$@%2$[で終わる]@";
"%[Name]@ %[Is]@ %@" = "%1$[名前]@が%3$@%2$[である]@";

/* Search criteria for other color space properties of a file */
"%[Orientation]@ %[Any Orientation]@" = "%1$[方向]@が%2$[いずれかの方向]@";
"%[Orientation]@ %[Landscape]@" = "%1$[方向]@が%2$[横]@";
"%[Orientation]@ %[Portrait]@" = "%1$[方向]@が%2$[縦]@";

/* Menu item to bring up an additional list of search criteria */
"%[Other...]@" = "%[その他...]@";

/* Search criteria for raw query type */
"%[Raw query]@ %@" = "%1$[RAW クエリー]@が%2$@";

/* Search criteria for generic search-by-all-fields type */
"%[Search for]@ %@" = "%2$@%1$[を検索]@";

/* Search criteria for files larger or smaller than a specific number of kilobytes, megabytes, or gigabytes */
"%[Size]@ %[Greater than]@ %@ %[KB]@" = "%1$[サイズ]@が%3$@%4$[KB]@%2$[より大きい]@";
"%[Size]@ %[Less than]@ %@ %[KB]@" = "%1$[サイズ]@が%3$@%4$[KB]@%2$[より小さい]@";
"%[Size]@ %[Greater than]@ %@ %[MB]@" = "%1$[サイズ]@が%3$@%4$[MB]@%2$[より大きい]@";
"%[Size]@ %[Less than]@ %@ %[MB]@" = "%1$[サイズ]@が%3$@%4$[MB]@%2$[より小さい]@";
"%[Size]@ %[Greater than]@ %@ %[GB]@" = "%1$[サイズ]@が%3$@%4$[GB]@%2$[より大きい]@";
"%[Size]@ %[Less than]@ %@ %[GB]@" = "%1$[サイズ]@が%3$@%4$[GB]@%2$[より小さい]@";

/* Search criteria for other visibility properties of a file */
"%[Visibility]@ %[Visible or Invisible]@" = "%1$[可視属性]@が%2$[可視または不可視]@";
"%[Visibility]@ %[Visible Items]@" = "%1$[可視属性]@が%2$[可視の項目]@";
"%[Visibility]@ %[Invisible Items]@" = "%1$[可視属性]@が%2$[不可視の項目]@";

